spec/fixtures/files/webhooks/authorised/success_with_cc_details.json

{
  "live": "false",
  "notificationItems": [
    {
      "NotificationRequestItem": {
        "additionalData": {
          "expiryDate": "12/2077",
          "authCode": "1234",
          "cardSummary": "7777",
          "totalFraudScore": "10",
          "hmacSignature": "ZmFrZV9zaWduYXR1cmU=",
          "NAME2": "VALUE2",
          "NAME1": "VALUE1",
          "storedPaymentMethodId": "webhooks_authorisation_success_stored_payment_method_id",
          "checkoutSessionId": "webhooks_authorisation_success_checkout_session_id",
          "fraudCheck-6-ShopperIpUsage": "10"
        },
        "amount": {
          "currency": "EUR",
          "value": 10100
        },
        "eventCode": "AUTHORISATION",
        "eventDate": "2025-07-25T15:40:40+02:00",
        "merchantAccountCode": "SpreeCommerceECOM",
        "merchantReference": "1234567890_1_uniq",
        "operations": [
          "CANCEL",
          "CAPTURE",
          "REFUND"
        ],
        "paymentMethod": "mc",
        "pspReference": "webhooks_psp_reference",
        "reason": "1234:7777:12/2012",
        "success": "true"
      }
    }
  ]
}